emacs/.emacs.d/init.el
;; -*- lexical-binding: t; -*-
;; NOTE: This file is generated from init.org.

(setq url-proxy-services
   '(("no_proxy" . "^\\(localhost\\|10\\..*\\|192\\.168\\..*\\)")
     ("http" . "127.0.0.1:7890")
     ("https" . "127.0.0.1:7890")))

(require 'package)
(setq package-enable-at-startup nil)
(setq package-archives '(("gnu"   . "https://elpa.gnu.org/packages/")
                         ("melpa-stable" . "https://stable.melpa.org/packages/")
                         ("melpa" . "https://melpa.org/packages/")))
(package-initialize)

;; install use-package if it does not exist
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
(require 'use-package)
(setq use-package-always-ensure nil)

(defun my/packages-installed-p ()
  (let ((ret t))
    (dolist (pkg package-selected-packages)
      (when (not (package-installed-p pkg)) (setq ret nil)))
    ret))

(setq package-selected-packages
      '(;; look and feel
        all-the-icons ;; and M-x all-the-icons-install-fonts
        doom-themes
        doom-modeline ;; and M-x nerd-icons-install-fonts
        visual-fill-column all-the-icons-dired rainbow-delimiters
        ;; org
        org org-roam org-bullets org-journal org-noter org-alert org-ql
        org-ref org-drill org-roam-ui org-fragtog org-contacts
        ;; utilities
        magit yasnippet ibuffer ivy counsel swiper projectile flycheck flycheck-haskell
        exec-path-from-shell activity-watch-mode try vlf pangu-spacing
        git-annex magit-annex pdf-tools zotxt telega alert dashboard htmlize simple-httpd crux deft
        ;; markup
        markdown-mode yaml-mode dockerfile-mode cmake-mode nix-mode bison-mode csv-mode auctex
        ;; programming
        numpydoc pyvenv ein matlab-mode typescript-mode php-mode web-mode go-mode ess
        geiser geiser-chez slime racket-mode sml-mode clojure-mode rust-mode haskell-mode lua-mode
        ))
(setq package-pinned-packages '((telega . "melpa-stable")))

;; Install packages
(unless (my/packages-installed-p)
  (message "%s" "Refreshing package database...")
  (package-refresh-contents)
  (package-install-selected-packages))
