emacs/.emacs.d/init.org
* Customization

#+begin_src elisp
  (add-to-list 'default-frame-alist '(height . 36)) ; frame height
  (add-to-list 'default-frame-alist '(width . 80))  ; frame width
  (tool-bar-mode -1)                                ; hide toolbar
  (scroll-bar-mode -1)                              ; hide scrollbar
  (setq-default
   inhibit-startup-screen t               ; hide startup screen
   tab-width 8
   indent-tabs-mode nil
   c-basic-offset 4
   cursor-type 'bar
   show-trailing-whitespace t
   show-paren-delay 0
   ;; major-mode 'org-mode
   line-spacing 0.1)
  ;; (fringe-mode '(0 . 0))
  (fringe-mode '(1 . 1))
  (show-paren-mode 1)                     ; parentheses matching
  (setq ring-bell-function 'ignore)
  (setq auth-sources '("~/.emacs.d/authinfo" "~/.emacs.d/authinfo.gpg" "~/.emacs.d/netrc"))
#+end_src

#+begin_src elisp
  (use-package doom-themes
    :init (load-theme 'doom-tomorrow-day t))
#+end_src

#+begin_src elisp
  (display-battery-mode t)
  (column-number-mode t)
  (display-time-mode t)
  (setq-default display-time-interval 30)
  (setq-default display-time-default-load-average nil)
  (setq-default display-time-format "%Y-%m-%d %a %H:%M")
  (use-package doom-modeline
    :init (doom-modeline-mode 1)
    :config
    (setq inhibit-compacting-font-caches t)
    (setq doom-modeline-enable-word-count t))
#+end_src

#+begin_src elisp
  (defvar my/ligature-cascadia-code-ligatures '("|||>" "<|||" "<==>" "<!--" "####" "~~>" "***" "||=" "||>"
                                                ":::" "::=" "=:=" "===" "==>" "=!=" "=>>" "=<<" "=/=" "!=="
                                                "!!." ">=>" ">>=" ">>>" ">>-" ">->" "->>" "-->" "---" "-<<"
                                                "<~~" "<~>" "<*>" "<||" "<|>" "<$>" "<==" "<=>" "<=<" "<->"
                                                "<--" "<-<" "<<=" "<<-" "<<<" "<+>" "</>" "###" "#_(" "..<"
                                                "..." "+++" "/==" "///" "_|_" "www" "&&" "^=" "~~" "~@" "~="
                                                "~>" "~-" "**" "*>" "*/" "||" "|}" "|]" "|=" "|>" "|-" "{|"
                                                "[|" "]#" "::" ":=" ":>" ":<" "$>" "==" "=>" "!=" "!!" ">:"
                                                ">=" ">>" ">-" "-~" "-|" "->" "--" "-<" "<~" "<*" "<|" "<:"
                                                "<$" "<=" "<>" "<-" "<<" "<+" "</" "#{" "#[" "#:" "#=" "#!"
                                                "##" "#(" "#?" "#_" "%%" ".=" ".-" ".." ".?" "+>" "++" "?:"
                                                "?=" "?." "??" ";;" "/*" "/=" "/>" "//" "__" "~~" "(*" "*)"
                                                "\\\\" "://"))

  (use-package ligature
    :load-path "git/ligature.el"
    :config
    ;; Enable the "www" ligature in every possible major mode
    (ligature-set-ligatures 't '("www"))
    ;; Enable traditional ligature support in eww-mode, if the
    ;; `variable-pitch' face supports it
    (ligature-set-ligatures 'eww-mode '("ff" "fi" "ffi"))
    (ligature-set-ligatures 'org-mode my/ligature-cascadia-code-ligatures)
    (ligature-set-ligatures 'prog-mode my/ligature-cascadia-code-ligatures)
    (ligature-set-ligatures 'markdown-mode '(("=" (rx (+ "=") (? (| ">" "<"))))
                                             ("-" (rx (+ "-")))))
    ;; (ligature-set-ligatures 'haskell-mode my/ligature-cascadia-code-ligatures)
    ;; (ligature-set-ligatures 'rust-mode my/ligature-cascadia-code-ligatures)
    ;; (ligature-set-ligatures 'python-mode '("www" "__" "!=" "=="))
    ;; enables ligature checks globally in all buffers. You can also do it
    ;; per mode with `ligature-mode'.
    (global-ligature-mode t))
#+end_src

#+begin_src elisp
  (setq word-wrap-by-category t)          ; make Emacs respect kinsoku rules when wrapping lines visually.
  ;; (set-face-attribute 'default nil :font "Fira Code-14")
  ;; (set-face-attribute 'italic nil :font "Cascadia Code-14" :slant 'italic)
  ;; (dolist (charset '(kana han symbol cjk-misc bopomofo))
  ;;   (set-fontset-font (frame-parameter nil 'font)
  ;;                     charset (font-spec :family "方正楷体_GBK" :size 20)))
  ;; (setq face-font-rescale-alist '(("方正楷体_GBK" . 1.3)))

  ;; Derived from Centaur Emacs
  (set-face-attribute 'default nil :family "Fira Code" :height 140)
  (set-fontset-font t 'unicode "Symbols Nerd Font Mono" nil 'prepend)
  (set-fontset-font t 'emoji (font-spec :family "Noto Color Emoji") nil 'prepend)
  (setq face-font-rescale-alist '(("方正楷体_GBK" . 1.28)))
  (set-fontset-font t '(#x4e00 . #x9fff) (font-spec :family "方正楷体_GBK"))
#+end_src

From https://zzamboni.org/post/beautifying-org-mode-in-emacs/.
#+begin_src elisp
  (custom-theme-set-faces
     'user
     '(variable-pitch ((t (:family "Merriweather" :height 1.0))))
     '(fixed-pitch ((t (:family "Fira Code Retina" :height 1.0)))))
  (add-hook 'org-mode-hook 'variable-pitch-mode)

  (custom-theme-set-faces
   'user
   '(org-document-title ((t (:height 1.4))))
   '(org-level-1 ((t (:inherit outline-1 :height 1.1))))
   '(line-number ((t (:inherit fixed-pitch))))
   '(line-number-current-line ((t (:inherit fixed-pitch))))
   '(org-block ((t (:inherit fixed-pitch))))
   '(org-code ((t (:inherit (shadow fixed-pitch)))))
   '(org-document-info-keyword ((t (:inherit (shadow fixed-pitch)))))
   '(org-indent ((t (:inherit (org-hide fixed-pitch)))))
   '(org-meta-line ((t (:inherit (font-lock-comment-face fixed-pitch)))))
   '(org-property-value ((t (:inherit fixed-pitch))) t)
   '(org-special-keyword ((t (:inherit (font-lock-comment-face fixed-pitch)))))
   '(org-table ((t (:inherit fixed-pitch :foreground "#83a598"))))
   '(table-cell ((t (:inherit fixed-pitch :background "#f5f5f5"))))
   '(org-tag ((t (:inherit (shadow fixed-pitch) :weight bold :height 0.8))))
   '(org-verbatim ((t (:inherit (shadow fixed-pitch))))))
#+end_src

* Functionality

Don't make backup files:

#+begin_src elisp
  (setq-default make-backup-files nil)
#+end_src

Allow to type German in Emacs:

#+begin_src elisp
  (setq mac-right-option-modifier 'none)  ; option + s --> ß
#+end_src

The =linum-mode= could slow down emacs when viewing large files or images. (refer to [[https://www.emacswiki.org/emacs/LineNumbers][this]] and [[https://github.com/redguardtoo/emacs.d/issues/178][this]])

#+begin_src elisp
  ;; (global-display-line-numbers-mode)
  ;; (global-hl-line-mode t)                 ; line highlighting
  ;; (global-visual-line-mode t)             ; line wrap
  (setq display-line-numbers-width 4)
  (dolist (mode '(text-mode-hook
                    prog-mode-hook
                    conf-mode-hook))
      (add-hook mode (lambda ()
                       (display-line-numbers-mode 1)
                       (visual-line-mode t)
                       (hl-line-mode t))))
#+end_src


For macOS:

#+begin_src elisp
  (when (memq window-system '(mac ns))
    (add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))
    (add-to-list 'default-frame-alist '(ns-appearance . light))
    (setq ns-use-proxy-icon  nil)
    (setq ns-pop-up-frames nil)
    (setq frame-title-format nil))
#+end_src


Enable copying to the system clipboard (from [[https://www.reddit.com/r/emacs/comments/mgj9dy/emacs_nw_cant_copy_to_system_clipboard/][this]]):
#+begin_src elisp
  (setq
    x-select-enable-clipboard t
    x-select-enable-primary nil
    x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING)
    x-stretch-cursor nil)
#+end_src

* Functions

** Add AucTeX file variables

From [[https://emacs.stackexchange.com/questions/27109/how-can-i-automatically-add-some-local-variables-info-to-a-c-x-c-f-new-tex-fi][this]].
#+begin_src elisp
  (defun my/add-auctex-file-variables ()
    (interactive)
    (if (and (not buffer-read-only)
             (string= (file-name-extension (buffer-file-name)) "tex"))
        (progn
          ;; (add-file-local-variable 'mode 'latex)
          (add-file-local-variable 'TeX-engine 'xetex)
          (goto-char (point-min)))))
  ;; (add-hook 'LaTeX-mode-hook 'my/add-auctex-file-variables)
#+end_src

** Get size of a directory

#+begin_src elisp
  (defun my/dired-get-size ()
    (interactive)
    (let ((files (dired-get-marked-files)))
      (with-temp-buffer
        (apply 'call-process "/usr/bin/du" nil t nil "-sch" files)
        (message "Size of all marked files: %s"
                 (progn
                   (re-search-backward "\\(^[0-9.,]+[A-Za-z]+\\).*total$")
                   (match-string 1))))))
#+end_src

