emacs/.emacs.d/init.el

(defun my/org-enable-write-mode ()
  (interactive)
  (display-line-numbers-mode -1)
  ;; (setq line-prefix "\t")
  ;; (setq line-prefix nil)
  (org-num-mode t)
  (setq-local visual-fill-column-width 80)
  (visual-fill-column-mode)
  (hl-line-mode -1)
  (setq-local org-bullets-bullet-list '(" "))
  (org-bullets-mode)
  )

(defun individual-visibility-source-blocks ()
  "Fold some blocks in the current buffer."
  (interactive)
  (org-show-block-all)
  (org-block-map
   (lambda ()
     (let ((case-fold-search t))
       (when (and
              (save-excursion
                (beginning-of-line 1)
                (looking-at org-block-regexp))
              (cl-assoc
               ':hidden                 ;  mark blocks with :hidden
               (cl-third
                (org-babel-get-src-block-info))))
         (org-hide-block-toggle))))))

(add-hook
 'org-mode-hook
 (function individual-visibility-source-blocks))

(defun my/org-backward-narrow ()
  (interactive)
  (progn
    (widen)
    (org-backward-heading-same-level 1 t)
    (org-narrow-to-subtree)))

(defun my/org-forward-narrow ()
  (interactive)
  (progn
    (widen)
    (org-forward-heading-same-level 1 t)
    (org-narrow-to-subtree)))

;; (defun my/open-alacritty ()
;;   (interactive "@")
;;   (shell-command (concat "alacritty --working-directory"
;;                          (file-name-directory (or load-file-name buffer-file-name))
;;                          " > /dev/null 2>&1 & disown") nil nil))
(defun my/open-alacritty ()
  (interactive)
  (call-process "alacritty" nil 0 nil "--working-directory" default-directory))

(defun rename-current-buffer-file ()
  "Renames current buffer and file it is visiting."
  (interactive)
  (let ((name (buffer-name))
        (filename (buffer-file-name)))
    (if (not (and filename (file-exists-p filename)))
        (error "Buffer '%s' is not visiting a file!" name)
      (let ((new-name (read-file-name "New name: " filename)))
        (if (get-buffer new-name)
            (error "A buffer named '%s' already exists!" new-name)
          (rename-file filename new-name 1)
          (rename-buffer new-name)
          (set-visited-file-name new-name)
          (set-buffer-modified-p nil)
          (message "File '%s' successfully renamed to '%s'"
                   name (file-name-nondirectory new-name)))))))

(defun my/org-extract-index-from-directory (directory)
  (let* ((filenames (directory-files directory nil "org$"))
         (metadata '())
         (text "# -*- mode: org -*-\n#+title: index\n\n"))
    (dolist (filename filenames text)
      (let* ((filepath (concat directory "/" filename))
             (meta (my/org-get-metadata filepath)))
        (add-to-list 'metadata meta)))
    (setq metadata (sort metadata #'(lambda (x y) (string< (nth 2 x) (nth 2 y)))))
    (dolist (meta metadata text)
      (setq text (concat text
                         (format "* TODO [[%s][%s]]" (nth 0 meta) (nth 2 meta))
                         ;; (replace-regexp-in-string "/" ":" (format "%s" (nth 1 meta)))
                         (if (nth 3 meta) (format "    %s\n" (nth 3 meta)) "\n")
                         )))
    text))

(defun my/org-insert-index (directory outpath)
  (with-temp-buffer
    (insert (my/org-extract-index-from-directory directory))
      (write-region (point-min) (point-max) outpath nil)))

(defun my/org-generate-index ()
  (interactive)
  (my/org-insert-index "~/cloud/personal/orgroam" "~/temp/index.org")
  (find-file "~/temp/index.org"))

(defun my/org-insert-modified-time ()
  (when (eq major-mode 'org-mode)
    (org-roam-set-keyword "time_updated" (format-time-string "%Y-%m-%dT%H:%M:%S%:z"))))
(setq auto-revert-avoid-polling t)

(global-set-key (kbd "C-c m f") 'toggle-frame-fullscreen)
(global-set-key (kbd "C-c m m") 'toggle-frame-maximized)
(global-set-key (kbd "C-c m 0") 'text-scale-adjust)
(global-set-key (kbd "C-c m g") 'goto-line)
(global-set-key (kbd "C-c m r") 'revert-buffer)
(global-set-key (kbd "C-c m v") 'add-file-local-variable-prop-line)
(global-set-key (kbd "M-[") 'previous-buffer)
(global-set-key (kbd "M-]") 'next-buffer)
(global-set-key (kbd "s-，") 'customize)
(global-set-key (kbd "M-【") 'previous-buffer)
(global-set-key (kbd "M-】") 'next-buffer)
(global-set-key (kbd "C-<tab>") 'other-window)
(global-set-key (kbd "C-c C-x C-i") 'org-clock-in)
(global-set-key (kbd "C-c C-x C-o") 'org-clock-out)
(global-set-key (kbd "C-x C-r") 'rename-current-buffer-file)
(global-set-key (kbd "C-{") 'my/org-backward-narrow)
(global-set-key (kbd "C-}") 'my/org-forward-narrow)
(global-set-key (kbd "C-c m i") #'(lambda () (interactive) (find-file "~/.emacs.d/init.org")))
(global-set-key (kbd "C-c m s") #'(lambda () (interactive) (find-file "~/.ssh/config")))
(global-set-key (kbd "C-c m l") #'(lambda () (interactive) (load-file "~/.emacs.d/init.el")))
(global-set-key (kbd "C-c m t") 'my/org-generate-toc)
(global-set-key (kbd "C-c m d") 'my/org-generate-index)
(global-set-key (kbd "C-c m w") 'my/org-enable-write-mode)

(use-package exec-path-from-shell
  ;; :if (memq window-system '(mac ns))
  :init
  (exec-path-from-shell-initialize)
  :config
  (setq exec-path-from-shell-arguments '("-l")))

(use-package all-the-icons-dired
  :ensure nil
  :load-path "git/all-the-icons-dired"
  :hook (dired-mode . all-the-icons-dired-mode))

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

(use-package visual-fill-column
  :hook
  (org-mode . visual-fill-column-mode)
  :config
  (setq-default visual-fill-column-width 120
                visual-fill-column-center-text t)
  ;; (global-visual-fill-column-mode)
  )

(use-package crux
  :ensure t)

(use-package deft
  :bind ("<f8>" . deft)
  :commands deft
  :init
  (setq deft-extensions '("txt" "tex" "org" "md"))
  (setq deft-directory "~/cloud")
  (setq deft-recursive t)
  ;; replace all slashes and spaces with hyphens and will convert the file name to lowercase
  (setq deft-file-naming-rules
  '((noslash . "-")
    (nospace . "-")
    (case-fn . downcase))))

(use-package diff
  :config
  (setq diff-switches "-u -r"))

(use-package dired
  :ensure nil
  :bind (:map dired-mode-map (("?" . my/dired-get-size)))
  :config
  (setq dired-listing-switches "-avlh --time-style=long-iso --group-directories-first")
  (setq dired-guess-shell-alist-user '(("\\.pdf\\'" "okular")
                                       ("\\.doc\\'" "libreoffice")
                                       ("\\.docx\\'" "libreoffice")
                                       ("\\.ppt\\'" "libreoffice")
                                       ("\\.pptx\\'" "libreoffice")
                                       ("\\.xls\\'" "libreoffice")
                                       ("\\.xlsx\\'" "libreoffice")
                                       ("\\.jpg\\'" "pinta")
                                       ("\\.png\\'" "pinta")
                                       ("\\.java\\'" "idea")))
  (add-to-list 'display-buffer-alist
               (cons "\\*Async Shell Command\\*.*" (cons #'display-buffer-no-window nil))))

(use-package org
  :ensure t
