emacs/.emacs.d/init.org
* =org=

#+begin_src elisp :noweb yes
  (use-package org
    :ensure t
    :load-path "git/org-mode/lisp"
    :bind
    ("C-c a" . org-agenda)
    ("C-c c" . org-capture)
    :init
    (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook 'org-babel-tangle nil t))) ; tangle on save
    (add-hook 'org-mode-hook (lambda () (add-hook 'before-save-hook 'my/org-insert-modified-time nil 'local)))
    :config
    (require 'ox-latex)
    (setq org-adapt-indentation nil) ; prevent demoting heading also shifting text inside sections
    (setq org-tags-column 60)        ; set position of tags
    (setq org-hide-emphasis-markers nil)
    (font-lock-add-keywords 'org-mode
                            '(("^ *\\([-+]\\) "
                               (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))
    (setq org-image-actual-width nil)
    (setq org-startup-shrink-all-tables t)
    (setq org-startup-with-inline-images t)
    ;; (setq org-startup-numerated t)

    <<org-modules>>
    <<org-agenda>>
    <<org-babel>>
    <<org-capture>>
    <<org-export>>
    <<org-tempo>>
    <<org-publish>>
    <<org-attach>>
    <<org-crypt>>
    <<org-src>>
    <<org-link>>
    )
#+end_src


** =org-modules=

#+NAME: org-modules
#+begin_src elisp :tangle no
  (add-to-list 'org-modules 'org-habit)
  (add-to-list 'org-modules 'org-crypt)
  (add-to-list 'org-modules 'org-tempo)
  (add-to-list 'org-modules 'org-attach-git)
  (add-to-list 'org-modules 'org-protocol)
#+end_src

** =org-agenda=

#+NAME: org-agenda
#+begin_src elisp :tangle no
  (setq org-habit-graph-column 50) ; set position of habit graph
  (setq org-agenda-tags-column 80)
  ;; (setq org-agenda-files '("~/cloud/org/"))
  (setq org-agenda-file-regexp "\\`[^.].*\\.org\\.gpg\\'") ; ".org.gpg"
  (setq org-agenda-file-regexp "\\`[^.].*\\.org\\(\\.gpg\\)?\\'") ; ".org" or ".org.gpg"
  (setq org-log-into-drawer t)
  (setq org-log-done 'time)          ; record close time for todo item
  (setq org-duration-format 'h:mm)   ; time format
  (setq org-todo-keywords
        '((sequence "TODO(t)" "WAITING(w)" "|" "DONE(d)" "CANCELLED(c)")))
  (setq org-agenda-start-on-weekday nil)
  (setq org-agenda-custom-commands
        '(("r" "Review this week"
           ((agenda "" ((org-agenda-span 8)
                        (org-agenda-start-day "-7d")
                        (org-agenda-entry-types '(:timestamp))
                        ;; (org-agenda-tag-filter-preset '("+work"))
                        (org-agenda-show-log t)
                        (org-agenda-archives-mode t)
                        (org-agenda-clockreport-mode t)
                        ;; (org-agenda-log-mode-items '(clock closed))
                        ;; (org-agenda-start-with-log-mode '(closed))
                        ))
            ))
          ("w" "Agenda for work" agenda ""
           ((org-agenda-tag-filter-preset '("+work")) (org-agenda-clockreport-mode t))
           ("~/cloud/agenda.ics" "~/cloud/agenda.ps"))
          ("t" "Agenda for today" agenda ""
           ((org-agenda-span 1)))
          ;; ("Y" alltodo "" nil ("~/cloud/todo.html" "~/cloud/todo.txt"))
          ;; ("W" "Completed and/or deferred tasks from previous week"
          ;;  ((agenda "" ((org-agenda-span 7)
          ;;               (org-agenda-start-day "-7d")
          ;;               (org-agenda-entry-types '(:timestamp))
          ;;               (org-agenda-show-log t)))))
          ;; ("n" todo ""
          ;;  ((org-agenda-max-entries 5) (org-agenda-tag-filter-preset '("+work"))))
          ;; ("~/cloud/agenda.ics" "~/cloud/agenda.ps")
          ))
#+end_src

** =org-babel=

#+NAME: org-babel
#+begin_src elisp :tangle no
  (setq org-babel-python-command "python3")
  (setq org-export-babel-evaluate nil)
  (setq org-confirm-babel-evaluate nil)
  (org-babel-do-load-languages
   'org-babel-load-languages '((R . t)
                               (C . t)
                               (python . t)
                               (shell . t)
                               (ruby . t)
                               (haskell . t)
                               (scheme . t)
                               (awk . t)
                               (octave . t)
                               (lua . t)
                               (js . t)
                               (dot . t)))
#+end_src

** =org-capture=

#+NAME: org-capture
#+begin_src elisp :tangle no
  (setq org-default-notes-file "~/cloud/org/refile.gpg")
  (setq org-capture-templates
        '(("i" "Idea" entry
           (file+headline org-default-notes-file "Ideas")
           "* %U%?\n%i\n")
          ("t" "Task" entry
           (file+headline org-default-notes-file "Tasks")
           "* TODO %?\n %i\n %a")
          ("c" "Clipboard" entry
           (file+headline org-default-notes-file "Clipboard")
           "* %?\n%i\n%a")
          ("l" "Clock" entry
           (file+headline org-default-notes-file "Clock")
           "** %?\n" :clock-in t :clock-keep t)))
#+end_src

** =org-export=

#+NAME: org-export
#+begin_src elisp :tangle no
  (setq org-export-backends
        '(ascii beamer html icalendar latex man md odt texinfo))
  (setq org-export-coding-system 'utf-8)

  ;; org-latex
  (setq org-latex-listings 'minted)
  (setq org-latex-compiler "xelatex")
  (add-to-list 'org-latex-classes
               '("ctexart" "\\documentclass[11pt]{ctexart}"
                   ("\\section{%s}" . "\\section*{%s}")
                   ("\\subsection{%s}" . "\\subsection*{%s}")
                   ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                   ("\\paragraph{%s}" . "\\paragraph*{%s}")
                   ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
  (setq org-latex-packages-alist '(("" "minted")
                                   ("" "booktabs")
                                   ("" "listings")
                                   ("" "amssymb")
                                   ("" "amsmath")
                                   ("" "amsfonts")
                                   ("" "amsthm")
                                   ("" "mathtools")
                                   ("" "ctex" t ("xelatex"))))
  (setq org-latex-pdf-process
        '("latexmk -shell-escape -f -pdf -%latex -interaction=nonstopmode -output-directory=%o %f"))


  ;; org-latex-preview
  (setq org-latex-preview-numbered t
        org-latex-preview-compiler-command-map '(("xelatex" . "xelatex -no-pdf -shell-escape")
                                                 ("pdflatex" . "latex")
                                                 ("lualatex" . "dvilualatex")))

  ;; org-html
  (setq org-html-htmlize-output-type 'css)
  (setq org-html-head-include-default-style nil)
#+end_src

** =org-tempo=

#+NAME: org-tempo
#+begin_src elisp :tangle no
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("el" . "src elisp"))
  (add-to-list 'org-structure-template-alist '("sh" . "src sh"))
#+end_src

** =org-publish=

#+NAME: org-publish
#+begin_src elisp :tangle no
  (setq org-publish-project-alist
        '(
          ("notes-html-org"
           :base-directory "~/cloud/personal/orgroam"
           :base-extension "org"
           :publishing-directory "~/sync/publish/orgroam"
           :eval never-export
           :recursive t
           :html-head "<link rel=\"stylesheet\" type=\"text/css\" href=\"org.css\" />"
           :publishing-function org-html-publish-to-html
           :headline-levels 4
           :author "author"
           :email "email"
           :with-latex t
           :with-drawer t
           :with-timestamps t
           :with-email t
           :html-postamble auto
           ;; :auto-sitemap t
           ;; :sitemap-sort-files alphabetically
           ;; :sitemap-filename "sitemap.org"
           ;; :sitemap-title "Sitemap"
           )
          ("notes-html-static"
           :base-directory "~/cloud/personal/orgroam"
           :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
           :publishing-directory "~/sync/publish/orgroam"
           :recursive t
           :exclude "\\*proj\\*"
           :publishing-function org-publish-attachment)
          ("notes-html" :components ("notes-html-org" "notes-html-static"))))
#+end_src

