emacs/.emacs.d/init.el
  (setq org-attach-preferred-new-method 'dir)
  (setq org-attach-store-link-p t)
  (setq org-attach-dir-relative t)
  (setq org-attach-git-use-annex nil)
  (org-crypt-use-before-save-magic)
  (setq org-tags-exclude-from-inheritance '("crypt"))
  (setq org-crypt-key nil)
  (setq auto-save-default nil)
  (setq org-edit-src-content-indentation 0
        org-src-window-setup 'current-window
        org-src-strip-leading-and-trailing-blank-lines t
  )
  (defface org-link-id
    '((t :foreground "#9bae4c" :weight bold :underline t))
    "Face for Org-Mode links starting with id:."
    :group 'org-faces)
  (defface org-link-file
    '((t :foreground "#ff5555" :weight bold :underline t))
    "Face for Org-Mode links starting with file:."
    :group 'org-faces)
  (defface org-link-zotero
    '((t :foreground "#8959a8" :weight bold :underline t))
    "Face for Org-Mode links starting with zotero:."
    :group 'org-faces)
  ;; (org-link-set-parameters "id" :face 'org-link-id)
  ;; (org-link-set-parameters "file" :face 'org-link-file)
  (org-link-set-parameters
   "zotero"
   :face 'org-link-zotero
   :follow (lambda (zpath)
             ;; we get the "zotero:"-less url, so we put it back.
             (browse-url (format "zotero:%s" zpath))))
  (org-link-set-parameters
   "file"
   :face (lambda (path) (if (file-exists-p path) 'org-link 'org-warning)))
  (org-link-set-parameters
   "id"
   :face (lambda (id) (if (org-roam-id-find id) 'org-link-id 'org-warning)))
  )

(use-package org-bullets
  :hook (org-mode . org-bullets-mode))

(use-package org-roam
  :after org
  :ensure t
  :custom
  (org-roam-directory (file-truename "~/cloud/personal/orgroam"))
  (org-roam-db-location (file-truename "~/cloud/personal/orgroam/org-roam.db"))
  (org-roam-capture-templates
   '(("d" "default" plain
      "%?"
      :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                         "#+title: ${title}\n#+time_created: %<%Y-%m-%dT%H:%M:%S%:z>\n")
      :unnarrowed t)
     ("p" "recipe" plain
      "%?"
      :target (file+head "%<%Y%m%d%H%M%S>-recipe_${slug}.org"
                         "#+title: (recipe) ${title}\n#+filetags: :recipe:\n#+time_created: %<%Y-%m-%dT%H:%M:%S%:z>\n")
      :unnarrowed t)
     ("r" "reference" plain
      "%?"
      :target (file+head "%<%Y%m%d%H%M%S>-ref_${slug}.org"
                         "#+title: (ref) ${title}\n#+filetags: :ref:\n#+time_created: %<%Y-%m-%dT%H:%M:%S%:z>\n")
      :unnarrowed t)
     ("e" "English dictionary" plain
      "%?\n\n* Definition\n\n* Try\n\n* Further reading\n\n"
      :target (file+head "%<%Y%m%d%H%M%S>-english_dictionary_${slug}.org"
                         "#+title: English dictionary: ${title}\n#+filetags: :english:\n#+time_created: %<%Y-%m-%dT%H:%M:%S%:z>\n")
      :unnarrowed t)
     ))
  (org-roam-capture-ref-templates
   '(("r" "ref" plain
      "%?"
      :target (file+head "%<%Y%m%d%H%M%S>-ref_${slug}.org"
                         "#+title: (ref) ${title}\n#+filetags: :ref:\n#+time_created: %<%Y-%m-%dT%H:%M:%S%:z>\n\n${body}")
      :unnarrowed t)))
  (org-roam-node-display-template
      (concat "(" (propertize "${tags:10}" 'face 'org-tag) ") " "${title}"))
  :bind (("C-c n l" . org-roam-buffer-toggle)
         ("C-c n f" . org-roam-node-find)
         ("C-c n g" . org-roam-graph)
         ("C-c n i" . org-roam-node-insert)
         ("C-c n c" . org-roam-capture)
         ("C-c n e" . org-roam-ref-add)
         ("C-c n a" . org-roam-alias-add)
         ("C-c n t" . org-roam-tag-add)
         ;; Dailies
         ("C-c n j" . org-roam-dailies-capture-today))
  :config
  (org-roam-db-autosync-mode))

(use-package org-roam-protocol
  :after org-protocol)

(use-package org-journal
  :ensure t
  :defer t
  :config
  (setq org-journal-dir "~/cloud/personal/journal")
  (setq org-journal-date-format "%Y-%m-%d")
  (setq org-journal-file-format "journal")
  (setq org-journal-encrypt-journal t)
  (setq org-journal-file-type 'still)
  (defun org-journal-file-header-func (time)
    "Custom function to create journal header."
    (concat
     (pcase org-journal-file-type
       (`daily "# -*- mode: org -*-\n#+TITLE: Daily Journal\n#+STARTUP: showeverything")
       (`weekly "# -*- mode: org -*-\n#+TITLE: Weekly Journal\n#+STARTUP: folded")
       (`monthly "# -*- mode: org -*-\n#+TITLE: Monthly Journal\n#+STARTUP: folded")
       (`yearly "# -*- mode: org -*-\n#+TITLE: Yearly Journal\n#+STARTUP: folded")
       (`still "# -*- mode: org -*-\n#+TITLE: Journal\n#+STARTUP: folded"))))
  (setq org-journal-file-header 'org-journal-file-header-func))

(use-package org-alert
  :config
  (setq alert-default-style 'libnotify))

(use-package org-download
  :ensure t
  :defer t
  :init
  ;; Add handlers for drag-and-drop when Org is loaded.
  (with-eval-after-load 'org (org-download-enable))
  :custom
  (org-download-method 'directory)
  (org-download-image-dir "assets")
  (org-download-heading-lvl nil)
  (org-download-timestamp "%Y-%m-%dT%H-%M-%S%:z_")
  (org-image-actual-width 600)
  (org-download-screenshot-method
   (cond
    ((eq system-type 'gnu/linux)
     "xclip -selection clipboard -t image/png -o > '%s'")
    ((eq system-type 'darwin)
     "pngpaste %s")))
  :bind
  ("C-M-y" . org-download-screenshot))

(use-package yasnippet
  :hook ((prog-mode . yas-minor-mode)
         (org-mode . yas-minor-mode))
  :config
  (yas-global-mode)
  (setq yas-indent-line 'fixed))

(use-package ibuffer
  :ensure t
  :bind
  ("C-x C-b" . ibuffer)
  :config
  (setq ibuffer-saved-filter-groups
        '(("default"
           ("planner" (or
                       (name . "^\\*Calendar\\*$")
                       (name . "^diary$")))
           ("emacs" (or
                     (name . "^\\*scratch\\*$")
                     (name . "^\\*Messages\\*$")))
           ("emacs-config" (or (filename . ".emacs.d")
                               (filename . "init.el")))
           ("personal" (and (filename . "personal/")
                        (or (mode . org-mode)
                            (mode . prog-mode))))
           ("magit" (or
                     (name . "magit\*")
                     (mode . Magit)))
           ("ssh" (filename . "ssh:"))
           ("org" (mode . org-mode))
           ("dired" (mode . dired-mode))
           ("manual" (or
                      (name . "\\*Man")
                      (name . "\\*info\\*"))))))
  (add-hook 'ibuffer-mode-hook
            (lambda ()
              (ibuffer-switch-to-saved-filter-groups "default"))))

(use-package ivy
  :config
  (ivy-mode)
