emacs/.emacs.d/init.org
* =ivy=, =counsel=, =swiper= (search)

#+begin_src elisp
  (use-package ivy
    :config
    (ivy-mode)
    (setq ivy-use-virtual-buffers t)
    (setq enable-recursive-minibuffers t)
    (global-set-key (kbd "C-c C-r") 'ivy-resume)
    (global-set-key (kbd "<f6>") 'ivy-resume))

  (use-package counsel
    :ensure t
    :config
    (global-set-key (kbd "M-x") 'counsel-M-x)
    (global-set-key (kbd "C-x C-f") 'counsel-find-file)
    (global-set-key (kbd "<f1> f") 'counsel-describe-function)
    (global-set-key (kbd "<f1> v") 'counsel-describe-variable)
    (global-set-key (kbd "<f1> l") 'counsel-find-library)
    (global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
    (global-set-key (kbd "<f2> u") 'counsel-unicode-char)
    (global-set-key (kbd "C-c g") 'counsel-git)
    (global-set-key (kbd "C-c j") 'counsel-git-grep)
    (global-set-key (kbd "C-c k") 'counsel-ag)
    (global-set-key (kbd "C-x l") 'counsel-locate)
    (global-set-key (kbd "C-S-o") 'counsel-rhythmbox)
    (define-key minibuffer-local-map (kbd "C-r") 'counsel-minibuffer-history))

  (use-package swiper
    :ensure t
    :config
    ;; enable this if you want `swiper' to use it
    (setq search-default-mode #'char-fold-to-regexp)
    (global-set-key "\C-s" 'swiper))
#+end_src

* =impatient-mode=

From https://blog.bitsandbobs.net/blog/emacs-markdown-live-preview/.

#+begin_src elisp
  (use-package simple-httpd
    :ensure t
    :config
    (setq httpd-port 7070)
    (setq httpd-host (system-name)))

  (use-package impatient-mode
    :ensure t
    :commands impatient-mode)
#+end_src

#+begin_src elisp
  (defun my/markdown-filter (buffer)
    (princ
     (with-temp-buffer
       (let ((tmp (buffer-name)))
         (set-buffer buffer)
         (set-buffer (markdown tmp))
         (format "<!DOCTYPE html><html><title>Markdown preview</title><link rel=\"stylesheet\" href = \"https://cdnjs.cloudflare.com/ajax/libs/github-markdown-css/3.0.1/github-markdown.min.css\"/>
  <body><article class=\"markdown-body\" style=\"box-sizing: border-box;min-width: 200px;max-width: 980px;margin: 0 auto;padding: 45px;\">%s</article></body></html>" (buffer-string))))
     (current-buffer)))

  (defun my/markdown-preview ()
    "Preview markdown."
    (interactive)
    (unless (process-status "httpd")
      (httpd-start))
    (impatient-mode)
    (imp-set-user-filter 'my/markdown-filter)
    (imp-visit-buffer))
#+end_src

* =magit= (Git)

#+begin_src elisp
  (use-package magit
    :ensure t
    :init
    :bind
    ("C-x g" . magit-status)
    :config
    ;; (setq magit-display-buffer-function
    ;;     (lambda (buffer)
    ;;       (display-buffer buffer '(display-buffer-same-window))))
    (setq magit-display-buffer-function
      (lambda (buffer)
        (display-buffer
         buffer (if (and (derived-mode-p 'magit-mode)
                         (memq (with-current-buffer buffer major-mode)
                               '(magit-process-mode
                                 magit-revision-mode
                                 magit-diff-mode
                                 magit-stash-mode
                                 magit-status-mode)))
                    nil
                  '(display-buffer-same-window)))))
    )
#+end_src

* =auctex= (TeX)

#+begin_src elisp
  (use-package tex
    :defer t
    :ensure auctex
    :config
    (setq TeX-engine 'xetex)
    (setq TeX-auto-save t)
    (setq TeX-parse-self t)
    (setq TeX-PDF-mode t)
    (setq latex-run-command "pdflatex")
    (setq-default TeX-master nil)
    (add-hook 'LaTeX-mode-hook (lambda ()
                                 (push
                                  '("latexmk" "latexmk -pdf %s" TeX-run-TeX nil t
                                    :help "Run latexmk on file")
                                  TeX-command-list)))
    (add-hook 'LaTeX-mode-hook #'latex-extra-mode)
    (add-hook 'LaTeX-mode-hook #'turn-on-reftex)
    (add-hook 'LaTeX-mode-hook
              (defun preview-larger-previews ()
                (setq preview-scale-function
                      (lambda () (* 1.25
                                    (funcall (preview-scale-from-face))))))))
#+end_src

* =epg= (PGP)

#+begin_src elisp
  (use-package epa-file
    :ensure nil
    :config
    (epa-file-enable)
    (setq epa-pinentry-mode 'loopback))
#+end_src

* =pdf-tools= (PDF)

#+begin_src elisp
  (use-package pdf-tools
    :config
    (pdf-tools-install)
    (setq-default pdf-view-display-size 'fit-height)
    (setq TeX-view-program-selection '((output-pdf "PDF Tools"))
          TeX-view-program-list '(("PDF Tools" TeX-pdf-tools-sync-view))
          TeX-source-correlate-start-server t)
    ;; (add-hook 'pdf-view-mode-hook (lambda() (linum-mode -1)))
    (add-hook 'TeX-after-compilation-finished-functions #'TeX-revert-document-buffer))
#+end_src

* =projectile= (project)

#+begin_src elisp
  (use-package projectile
    :diminish projectile-mode
    :config (projectile-mode)
    (setq projectile-project-search-path '(("~/cloud". 4)))
    ()
    :bind-keymap ("C-c p" . projectile-command-map))
#+end_src

* =flycheck=

#+begin_src elisp
  (use-package flycheck
    :hook
    (after-init . global-flycheck-mode)
    (haskell-mode-hook . flycheck-haskell-setup)
    :config
    (setq flycheck-haskell-hlint-executable "~/.local/share/cabal/bin/hlint")
    (flycheck-add-mode 'javascript-eslint 'web-mode))
#+end_src

* =flyspell=

#+begin_src elisp
  (use-package flyspell
    :hook (org-mode . flyspell-mode))
#+end_src

* =telega=

#+begin_src elisp
  (use-package telega
    :config
    (setq telega-directory "~/.local/share/telega")
    (setq telega-database-dir "~/.local/share/telega")
    ;; (define-key global-map (kbd "C-c t") telega-prefix-map)
    (add-hook 'telega-load-hook
              (lambda ()
                (define-key global-map (kbd "C-c t") telega-prefix-map)))
    (add-hook 'telega-root-mode-hook (lambda () (setq show-trailing-whitespace nil)))
    (add-hook 'telega-chat-mode-hook (lambda () (setq show-trailing-whitespace nil)))
  )
#+end_src

#+begin_src elisp
  (use-package page-break-lines
  :ensure t
  :hook (dashboard-mode-hook . page-break-lines-mode))
#+end_src

* =beancount=

#+begin_src elisp
  (use-package beancount
    :ensure nil
    :load-path "git/beancount-mode"
    :mode (("\\.beancount\\'" . beancount-mode)))
  ;; (add-to-list 'load-path "~/.emacs.d/beancount-mode")
  ;; (require 'beancount)
  ;; (add-to-list 'auto-mode-alist '("\\.beancount\\'" . beancount-mode))
#+end_src

* =activity-watch-mode=

#+begin_src elisp
  (use-package activity-watch-mode
    :config
    (global-activity-watch-mode))
#+end_src

* =markdown-mode=

#+begin_src elisp
  (use-package markdown-mode
    :ensure t
    :mode (("README\\.md\\'" . gfm-mode)
           ("\\.md\\'" . markdown-mode)
           ("\\.markdown\\'" . markdown-mode))
    :init (setq markdown-command "pandoc -t html5"))
#+end_src

* =pyvenv=                                                  :prog:

#+begin_src elisp
  (use-package pyvenv
    :ensure t
    :config
    (pyvenv-mode t))
#+end_src

* =geiser=                                                  :prog:

#+begin_src elisp
  (use-package geiser
    :config
    (setq geiser-chez-binary "scheme")
    (setq geiser-default-implementation 'chez))
#+end_src

* =slime=                                                   :prog:

#+begin_src elisp
  (use-package slime
    :init
    (setq inferior-lisp-program "sbcl"))
#+end_src

* =web-mode=                                                :prog:

#+begin_src elisp
  (use-package web-mode
    :mode (("\\.phtml\\'" . web-mode)
           ("\\.tpl\\.php\\'" . web-mode)
           ("\\.[agj]sp\\'" . web-mode)
           ("\\.as[cp]x\\'" . web-mode)
           ("\\.erb\\'" . web-mode)
           ("\\.mustache\\'" . web-mode)
           ("\\.djhtml\\'" . web-mode)
           ("\\.html?\\'" . web-mode)
           ("\\.vue\\'" . web-mode))
    :config
    (setq web-mode-code-indent-offset 2)
    (setq web-mode-css-indent-offset 2)
    (setq web-mode-markup-indent-offset 2)
    (setq web-mode-part-padding 0)
    (setq web-mode-script-padding 0)
    (setq web-mode-style-padding 0))
#+end_src

* =js=                                                      :prog:

#+begin_src elisp
  (use-package js
    :config
    (setq js-indent-level 2))
#+end_src

* COMMENT INACTIVE
:PROPERTIES:
:header-args: tangle no
:END:

** =which-key=
#+begin_src elisp
  (use-package which-key
    :init (which-key-mode)
    :config
    (setq which-key-idle-delay 1))
#+end_src

** =org-roam= (v1)
#+begin_src elisp
  (use-package org-roam
    :hook
    (after-init . org-roam-mode)
    :custom
    (org-roam-directory "~/cloud/personal/orgroam")
    :bind (:map org-roam-mode-map
                (("C-c n l" . org-roam)
                 ("C-c n f" . org-roam-find-file)
                 ("C-c n g" . org-roam-graph)
                 ("C-c n r" . org-roam-random-note)
                 ("C-c n j" . org-roam-jump-to-index))
                :map org-mode-map
                (("C-c n i" . org-roam-insert))
                (("C-c n I" . org-roam-insert-immediate)))
    :config
    (setq org-roam-graph-executable "/usr/local/bin/dot")
    (setq org-roam-index-file "~/cloud/personal/orgroam/index.org"))
#+end_src

